---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.Beam
enum: Autodesk.Revit.UI.PostableCommand
zh: 梁
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.Beam

**中文**: 梁

Adds individual beams, a chain of beams, or beams along grid lines.